[{"no":1,"key":"L53YZDVV","pop":"Agbenyega 2015, Thailand","link":"https://eric.ed.gov/?id=EJ1069532","intervention":"Inclusive","outcomes":"Early,Attitude,Pedagogical","country":"Thailand","abstract\r":"Educating children with disabilities alongside their peers in mainstream preschools has increased intensely over the past few years, affecting all aspects of early childhood education. Many children who previously would have been educated in segregated special centres are now being included in inclusive preschools. This research paper discusses how Thai preschool teachers' professional knowledge in inclusive education influence the ways they practice within preschool classrooms. Qualitative data obtained through observations and collaborative inquiry with teachers drawn from four preschool in Bangkok, Thailand showed that the lack of adequate teacher preparation for inclusive practice rendered the teachers helpless and unable to deliver curriculum that caters for the learning needs of children with disabilities. This paper contributes to the growing body of research to inform the usefulness of collaborative inquiry in helping teachers explore educational issues in systematic ways and determine solutions through reflection and dialogic inquiry.\"\r\n2,ASE6LY3N,\"Cheng 2015, China"},{"no":9,"key":"S5I7CJFS","pop":"Martin 2001, China","link":"https://www.jstor.org/stable/44390116","intervention":"Sensory","outcomes":"Special,Pedagogical,Learning,Behaviour","country":"China","abstract\r":"This article presents research that was conducted at the Autism Institute, an organization serving children with autism and their families in the People's Republic of China. The article examines and highlights aspects of the teacher training model at the Autism Institute that have led to the preparation of highly qualified, enthusiastic, and knowledgeable teachers of children with autism. Results of the research indicated that teacher education was highly valued at this organization, and teachers were seen as the most important part of the organization. Teachers received ongoing, systematic and specific on-the-job instruction. One of the most important features of this organization regarding teacher training was found to be the relationships between upper level staff including instructional leaders, and newer classroom teachers. These relationships were positive and based on mutual understanding and respect, and this has impacted the nature and success of teacher training. Implications for practice are discussed. [ABSTRACT FROM AUTHOR]\"\r\n10,IN7M6QNL,\"McCabe 2008, China"}]